#include "testprocedure6b5429426.h"

TestProcedure6B5429426::TestProcedure6B5429426(QObject *parent):Adapter6B5429233(parent)
{
    qDebug() << "create TestProcedure 6B5.429.426";
}

TestProcedure6B5429426::~TestProcedure6B5429426()
{
    qDebug() << "delete TestProcedure 6B5.429.426";
}


void TestProcedure6B5429426::start()
{
    bool result41 = true;
    bool result42 = true;
    bool result43 = true;
    bool result44 = true;
    bool result45 = true;
    bool result46 = true;

    setRunning(true);
    emit progressBarChanged(0);
    //==================================================================================================

    // НАЧАЛЬНЫЕ УСТАНОВКИ
    {

        addStageLine("", "Начало проверки");

        if (!startSettings()){
            stop();
            return;
        }

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

    }

    emit progressBarChanged(10);

    //==================================================================================================

    //==================================================================================================

    if (dataASK.getPunkt() == "Полная проверка") {

        // ПУНКТ 4.1 ---------------------------------------------------------------------------------------------
        result41 = checkPunkt41();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        emit progressBarChanged(20);

        // ПУНКТ 4.2---------------------------------------------------------------------------------------------
        result42 = checkPunkt42();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        emit progressBarChanged(30);

        // ПУНКТ 4.3---------------------------------------------------------------------------------------------
        result43 = checkPunkt43();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        emit progressBarChanged(50);

        // ПУНКТ 4.4---------------------------------------------------------------------------------------------
        result44 = checkPunkt44();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        emit progressBarChanged(65);

        // ПУНКТ 4.5---------------------------------------------------------------------------------------------
        result45 = checkPunkt45();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        emit progressBarChanged(80);

        // ПУНКТ 4.6---------------------------------------------------------------------------------------------
        result46 = checkPunkt46();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        emit progressBarChanged(90);

        addProcessLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ИЗДЕЛИЯ==============================================");
        if ((result41) & (result42) & (result43) & (result44) & (result45) & (result46)) {
            addProcessLine("РЕЗУЛЬТАТ: Соответствует ТУ");
            dataASK.setResult("признан годным");
        }
        else {
            addProcessLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            dataASK.setResult("признан не годным");
        }

        showMessageBox(AppMessageType::SAVETOBASE, "6Б5.429.426");

    }


    if (dataASK.getPunkt() == "4.1") {

        // ПУНКТ 4.1
        result41 = checkPunkt41();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        //==================================================================================================

        emit progressBarChanged(80);

        addProcessLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ИЗДЕЛИЯ==============================================");
        if (result41) {
            addProcessLine("РЕЗУЛЬТАТ: Соответствует ТУ");
            dataASK.setResult("Соответствует");
        }
        else {
            addProcessLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            dataASK.setResult("Не соответствует");
        }
    }


    if (dataASK.getPunkt() == "4.2") {

        // ПУНКТ 4.2
        result42 = checkPunkt42();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        //==================================================================================================

        emit progressBarChanged(80);

        addTelemetryLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ИЗДЕЛИЯ==============================================");
        if (result42) {
            addTelemetryLine("РЕЗУЛЬТАТ: Соответствует ТУ");
            dataASK.setResult("Соответствует");
        }
        else {
            addTelemetryLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            dataASK.setResult("Не соответствует");
        }
    }


    if (dataASK.getPunkt() == "4.3") {

        // ПУНКТ 4.3
        result43 = checkPunkt43();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        //==================================================================================================

        emit progressBarChanged(80);

        addTelemetryLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ИЗДЕЛИЯ==============================================");
        if (result43) {
            addTelemetryLine("РЕЗУЛЬТАТ: Соответствует ТУ");
            dataASK.setResult("Соответствует");
        }
        else {
            addTelemetryLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            dataASK.setResult("Не соответствует");
        }
    }


    if (dataASK.getPunkt() == "4.4") {

        // ПУНКТ 4.4
        result44 = checkPunkt44();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        //==================================================================================================

        emit progressBarChanged(80);

        addTelemetryLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ИЗДЕЛИЯ==============================================");
        if (result44) {
            addTelemetryLine("РЕЗУЛЬТАТ: Соответствует ТУ");
            dataASK.setResult("Соответствует");
        }
        else {
            addTelemetryLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            dataASK.setResult("Не соответствует");
        }
    }


    if (dataASK.getPunkt() == "4.5") {

        // ПУНКТ 4.5
        result45 = checkPunkt45();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        //==================================================================================================

        emit progressBarChanged(80);

        addTelemetryLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ИЗДЕЛИЯ==============================================");
        if (result45) {
            addTelemetryLine("РЕЗУЛЬТАТ: Соответствует ТУ");
            dataASK.setResult("Соответствует");
        }
        else {
            addTelemetryLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            dataASK.setResult("Не соответствует");
        }
    }


    if (dataASK.getPunkt() == "4.6") {

        // ПУНКТ 4.6
        result46 = checkPunkt46();

        if (!isRunning()) {
            stop();
            emit showMessageBox(AppMessageType::WARNINGCODE, "Работа завершена оператором!");
            return;
        }

        //==================================================================================================

        emit progressBarChanged(80);

        addTelemetryLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ИЗДЕЛИЯ==============================================");
        if (result46) {
            addTelemetryLine("РЕЗУЛЬТАТ: Соответствует ТУ");
            dataASK.setResult("Соответствует");
        }
        else {
            addTelemetryLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            dataASK.setResult("Не соответствует");
        }
    }

    //==================================================================================================

    addStageLine("", "Завершение работы");
    stop();
    emit progressBarChanged(100);
}

bool TestProcedure6B5429426::checkPunkt41()
{
    double dataV = 0;
    bool result = true;

    addStageLine("4.1", "Проверка логики работы ИМ4, ИМ6");

    // пункт 4.1.1
    {
        addProcessLine("=============== 4.1.1 ===============");

    }

    //==================================================================================================

    // пункт 4.1.2
    {
        addProcessLine("=============== 4.1.2 ===============");

    }

    //==================================================================================================

    // пункт 4.1.3
    {
        addProcessLine("=============== 4.1.3 ===============");

    }

    //==================================================================================================

    // пункт 4.1.4
    {
        addProcessLine("=============== 4.1.4 ===============");
    }

    //==================================================================================================

    // пункт 4.1.5
    {
        addProcessLine("=============== 4.1.5 ===============");
    }

    //==================================================================================================


    addProcessLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ПУНКТА 4.1=========================================");
    if (result) {
        addProcessLine("РЕЗУЛЬТАТ: Соответствует ТУ");
        return true;
    }
    else {
            addProcessLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            return false;
        }

}

bool TestProcedure6B5429426::checkPunkt42()
{
    double dataV = 0;
    bool result = true;

    addStageLine("4.2", "Проверка и регулирование сигнализатора");

    // пункт 4.2.1
    {
        addProcessLine("=============== 4.2.1 ===============");

    }

    //==================================================================================================

    // пункт 4.2.2
    {
        addProcessLine("=============== 4.2.2 ===============");

    }

    //==================================================================================================

    // пункт 4.2.3
    {
        addProcessLine("=============== 4.2.3 ===============");

    }

    //==================================================================================================

    // пункт 4.2.4
    {
        addProcessLine("=============== 4.2.4 ===============");
    }

    //==================================================================================================

    // пункт 4.2.5
    {
        addProcessLine("=============== 4.2.5 ===============");
    }

    //==================================================================================================

    // пункт 4.2.6
    {
        addProcessLine("=============== 4.2.6 ===============");
    }

    //==================================================================================================

    // пункт 4.2.7
    {
        addProcessLine("=============== 4.2.7 ===============");
    }

    //==================================================================================================

    // пункт 4.2.8
    {
        addProcessLine("=============== 4.2.8 ===============");
    }

    //==================================================================================================


    addProcessLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ПУНКТА 4.2=========================================");
    if (result) {
        addProcessLine("РЕЗУЛЬТАТ: Соответствует ТУ");
        return true;
    }
    else {
            addProcessLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            return false;
        }
}

bool TestProcedure6B5429426::checkPunkt43()
{
    double dataV = 0;
    bool result = true;

    addStageLine("4.3", "Проверка логики работы блока по сигналам 'Ф' и 'К2'");

    // пункт 4.3.1
    {
        addProcessLine("=============== 4.3.1 ===============");

    }

    //==================================================================================================

    // пункт 4.3.2
    {
        addProcessLine("=============== 4.3.2 ===============");

    }

    //==================================================================================================

    // пункт 4.3.3
    {
        addProcessLine("=============== 4.3.3 ===============");

    }

    //==================================================================================================

    // пункт 4.3.4
    {
        addProcessLine("=============== 4.3.4 ===============");
    }

    //==================================================================================================

    // пункт 4.3.5
    {
        addProcessLine("=============== 4.3.5 ===============");
    }

    //==================================================================================================

    // пункт 4.3.6
    {
        addProcessLine("=============== 4.3.6 ===============");
    }

    //==================================================================================================

    // пункт 4.3.7
    {
        addProcessLine("=============== 4.3.7 ===============");
    }

    //==================================================================================================


    addProcessLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ПУНКТА 4.3=========================================");
    if (result) {
        addProcessLine("РЕЗУЛЬТАТ: Соответствует ТУ");
        return true;
    }
    else {
            addProcessLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            return false;
        }
}

bool TestProcedure6B5429426::checkPunkt44()
{
    double dataV = 0;
    bool result = true;

    addStageLine("4.4", "Измерение временных параметров блока");

    // пункт 4.4.1
    {
        addProcessLine("=============== 4.4.1 ===============");

    }

    //==================================================================================================

    // пункт 4.4.2
    {
        addProcessLine("=============== 4.4.2 ===============");

    }

    //==================================================================================================

    // пункт 4.4.3
    {
        addProcessLine("=============== 4.4.3 ===============");

    }

    //==================================================================================================

    // пункт 4.34.4
    {
        addProcessLine("=============== 4.4.4 ===============");
    }

    //==================================================================================================

    // пункт 4.4.5
    {
        addProcessLine("=============== 4.4.5 ===============");
    }

    //==================================================================================================

    // пункт 4.4.6
    {
        addProcessLine("=============== 4.4.6 ===============");
    }

    //==================================================================================================

    // пункт 4.4.7
    {
        addProcessLine("=============== 4.4.7 ===============");
    }

    //==================================================================================================


    addProcessLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ПУНКТА 4.4=========================================");
    if (result) {
        addProcessLine("РЕЗУЛЬТАТ: Соответствует ТУ");
        return true;
    }
    else {
            addProcessLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            return false;
        }
}

bool TestProcedure6B5429426::checkPunkt45()
{
    double dataV = 0;
    bool result = true;

    addStageLine("4.5", "Проверка предполотного контроля");

    // пункт 4.5
    {
        addProcessLine("=============== 4.5 ===============");

    }

    //==================================================================================================


    addProcessLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ПУНКТА 4.5=========================================");
    if (result) {
        addProcessLine("РЕЗУЛЬТАТ: Соответствует ТУ");
        return true;
    }
    else {
            addProcessLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            return false;
        }
}

bool TestProcedure6B5429426::checkPunkt46()
{
    double dataV = 0;
    bool result = true;

    addStageLine("4.6", "Проверка работы БУФ по отказу f2 ");

    // пункт 4.6
    {
        addProcessLine("=============== 4.6 ===============");

    }

    //==================================================================================================


    addProcessLine("===============РЕЗУЛЬТАТ ПРОВЕРКИ ПУНКТА 4.6=========================================");
    if (result) {
        addProcessLine("РЕЗУЛЬТАТ: Соответствует ТУ");
        return true;
    }
    else {
            addProcessLine("РЕЗУЛЬТАТ: Не соответствует ТУ");
            return false;
        }
}
